In [7]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [9]:
# Data frame
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

df.head()
df.tail(2)
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [12]:
bank_account = pd.Series([2300, 4390, 5000, 1100], name="Bank Accounts")
bank_account.describe()

count       4.000000
mean     3197.500000
std      1814.393838
min      1100.000000
25%      2000.000000
50%      3345.000000
75%      4542.500000
max      5000.000000
Name: Bank Accounts, dtype: float64

In [13]:
screentime_data = pd.read_csv("screentime.csv")
screentime_data.head()

,user_id,age,gender,occupation,work_mode,screen_time_hours,work_screen_hours,leisure_screen_hours,sleep_hours,sleep_quality_1_5,stress_level_0_10,productivity_0_100,exercise_minutes_per_week,social_hours_per_week,mental_wellness_index_0_100,Unnamed: 15
0,U0001,33,Female,Employed,Remote,10.79,5.44,5.35,6.63,1,9.3,44.7,127,0.7,9.3,NaN
1,U0002,28,Female,Employed,In-person,7.40,0.37,7.03,8.05,3,5.7,78.0,74,2.1,56.2,NaN
2,U0003,35,Female,Employed,Hybrid,9.78,1.09,8.69,6.48,1,9.1,51.8,67,8.0,3.6,NaN
3,U0004,42,Male,Employed,Hybrid,11.13,0.56,10.57,6.89,1,10.0,37.0,0,5.7,0.0,NaN
4,U0005,28,Male,Student,Remote,13.22,4.09,9.13,5.79,1,10.0,38.5,143,10.1,0.0,NaN

- 3 câu hỏi thống kê dữ liệu định lượng:
    - Có bao nhiêu người trong này là người đi làm?
    - Số điểm trung bình của mental wellness index là bao nhiêu?
    - Số giờ ngủ trung bình là bao nhiêu?
- 3 câu hỏi thống kê dữ liệu định tính:
    - Nghề nghiệp nào phổ biến nhất?

In [15]:
screentime_data["stress_level_0_10"].describe()

count    400.000000
mean       8.150500
std        2.094844
min        0.000000
25%        6.900000
50%        8.800000
75%       10.000000
max       10.000000
Name: stress_level_0_10, dtype: float64